
Практикум
Привет! Это поддержка Практикума 👋 Если что-то не получается — постараемся помочь. Пишите в чат или выберите другой способ связи
Пн, 19 апреля
в 14:59
Привет! подскажите пожалуйста есть какие-то общие проблемы с юпитером ЯП ?14:59
Мы уже начали заниматься вашим вопросом, ответим в ближайшее время
не открывается страничка15:00
а нет. Потупило и заработало15:00
Практикум
Привет, Владимир!

Давайте разбираться. Отправьте, пожалуйста, скриншот страницы. А также подскажите, каким браузером пользуетесь? :)​15:00
​Рады слышать, что всё пришло в норму. Если проблема повторится, пишите – мы рядом и всегда подскажем 😉15:01
Ср, 21 апреля
в 15:12
Добрый день! Прохожу первый урок data-scientist, Линейная алгебра, Создание векторов. Тренажер не обрабатывает код. Подскажите пожалуйста есть какие-то общие проблемы ?15:12
Мы уже начали заниматься вашим вопросом, ответим в ближайшее время
пишет Ваш компьютер не дождался ответа от нашего сервера15:12
проверил с сетью все нормально15:12
ПрактикумДобрый день, Владимир!
Уже знаем о проблеме и кинули все силы на её починку :)
Сейчас есть возможность сделать небольшой перерыв и вернуться к выполнению задания немного позднее. Рекомендуем перед продолжением очистить кэш браузера, чтобы всё точно заработало​.​​15:13
Подскажите пожалуйста сколько примерно времени могут занять работы ? Чтобы проверять кэш и т.п. а не отвлекать Вас ?15:18
ПрактикумМы дадим вам знать, как наладим работу тренажёра, ожидайте :)​15:26
Кажется проблема решена.16:09
Практикум​Да, заработал, но следим за развитием событий :)16:13
опять проблемы с тренажером17:40
Практикум​Да, к сожалению :(
Мы уже заняты устранением неполадок. Дадим вам знать, как наладим работу тренажёра​.17:42
Есть какие-то надежды сегодня ?19:06
Практикум
​Увы, точных сроков пока нет.

Стараемся уладить вопрос как можно скорее.19:09
​Возвращаемся к вам :)

Проверьте, пожалуйста, заработал ли тренажёр и дайте нам знать 🖤20:16
Доброе утро! Сегодня опять проблемы с тренажером ?11:09
периодически пишет о проблемах с доступом11:15
Практикум
Добрый день!

Увы, всё ещё наблюдаются некоторые проблемы.11:16
Ср, 11 августа
в 14:01
Привет! подскажите пожалуйста есть какие -то общие проблемы с тренажером ? выдает 500 ошибку14:01
Мы уже начали заниматься вашим вопросом, ответим в ближайшее время
курс по DS. спринт Извлечение данных урок Отношения между таблицами - поиск данных14:01
первое задание14:01
возможно отвалилась табличка к которой обращаюсь ?14:03
ПрактикумЗдравствуйте!Сейчас, действительно, испытываем небольшие нагрузки — ожидаем, что в течение часа работа будет восстановлена, но может потребоваться немного больше времени. Над этим трудится целая команда наших специалистов :)14:09
заработало15:18
ПрактикумОтлично! Будут ещё вопросы – пишите :)​15:20
Пн, 16 августа
в 14:26
Добрый день! В тренажере появляется 401 ошибка. Выполняю 5 шаг в самостоятельном проекте DS- Извлечение данных14:26
Мы уже начали заниматься вашим вопросом, ответим в ближайшее время
в других уроках темы извлечение данных такая же проблема14:28
ПрактикумПриветствуем!
Кажется сейчас в решении есть ошибка, попробуйте найти и исправить её самостоятельно. Если не получается или задание после правок не принимается, то советуем обратиться к наставнику, поддержка, увы, не может помочь по задачам в тренажёре, мы готовы разобрать с вами технические вопросы.14:28
Неизвестная ошибка
Код ошибки: 401
Что делать?
Напишите нам, и мы постараемся помочь.14:29
проверяю в уже пройденном и зачтенном уроке14:29
ПрактикумПожалуйста, пришлите ссылку на ваш код в https://pastebin.com (вставляете там код, жмёте «Create New Paste» и копируете ссылку).
14:29
Поиск данных в таблице - код https://pastebin.com/v9zJaDN714:30
задание 3 как пример14:30
Практикум
​Спасибо.

В решении в самом деле есть ошибка.

Попробуйте, пожалуйста, обратиться к наставнику. 🖤14:33
свяите меня пожалуйста с человеком14:33
тренажер не должен возвращать код ошики14:33
разобрался. почистил кеш и все заработало14:35
Практикум
​Команда поддержки состоит из людей. 

Если хотите, мы передадим код коллегам с факультета, но на это уйдёт больше времени, чем напрямую связаться с наставником.14:35
Рады, что у вас всё получилось!


Если возникнут ещё вопросы, пожалуйста, обращайтесь 🖤14:35
Вт, 23 апреля
в 13:34
de3_8.sql13:34
Мы уже начали заниматься вашим вопросом, ответим в ближайшее время
Добрый день! Помогите пожалуйста с тренажером по курсу DE Спринт 3/12: ETL: автоматизация подготовки данных → Тема 2/7: Анализ вводных по задаче → Урок 8/11

Прикрепил запросы на создание таблиц13:34


Тренажер выдает ошибку что строк ожидается 22 а их 23. Но всего в файлах 23 признака13:35
customer_research.csv13:35
user_activity_log.csv13:35
user_order_log.csv13:35
Не понимаю что ожидает получить тренажер13:36
Практикум
Здравствуйте!

Подскажите, обращались ли вы по этому вопросу к преподавателю?13:38
Нет. Сейчас я нахожусь в академе и догоняю свой будущий курс13:39
кажется нашел описание полей которые ожидаются. Вопрос пока снят13:41

В файле user_order_log при скачивании с S3 есть поле uniq_id которое судя по всему нужно добавить в проверку тренажера или убрать из файла. Передайте пожалуйста этот момент разработчику курса13:44
поля id нет в файле customer_research13:49
ПрактикумБлагодарим за обратную связь, всё передали коллегам на проверку :)13:50
Выбрать способ связи
Задайте вопрос



Открыть виджет юзера
Пригласить друзей

Задание
Ревью
Шаг 2/3
Выполните задание, загрузите код на GitHub
и нажмите кнопку «Проверить задание»

Проверить задание
Github настроен
Отправка задания
Проверка
Если проект не удаётся отправить обычным способом, его можно загрузить архивом. Подробнее

Проект
Важная особенность корпоративных хранилищ — возможность интегрировать новые источники. В этом проекте вы как раз и добавите новый источник в DWH.
Маркетплейс товаров ручной работы набирает популярность и расширяет свою аудиторию. Чтобы привлечь больше покупателей, приобрели ещё один сайт, который предоставляет похожие услуги. Формальная часть сделки завершена, нужно интегрировать данные купленного сайта в хранилище.
Добавление нового источника — тот же процесс, что и загрузка предыдущих источников: нужно интегрировать данные и построить новую витрину. Вы уже строили инкрементальную витрину с отчётом по мастерам, теперь постройте похожую витрину с отчётом по заказчикам. Она пригодится, чтобы внедрить программу лояльности, изучить интересы пользователей, сделать более релевантной систему рекомендаций товаров и скорректировать маркетинговый план по акциям.
Общая схема проекта выглядит следующим образом:

Бо́льшую часть работы вы сделали, осталось только загрузить данные нового источника в хранилище и построить витрину. 
Инструкция по выполнению
Шаг 1. Подключение к базе
Вам понадобится та же БД, с которой вы работали в течение всего спринта. Напомним схему подключения, таблицы и модель данных:
В схеме dwh — таблицы измерений для мастеров ручной работы (d_craftsman), заказчиков (d_customer) и товаров (d_product). Также там есть таблица фактов о продажах (f_order), инкрементальная витрина по мастерам за отчётные периоды (craftsman_report_datamart) и MATERIALIZED VIEW с отчётом продаж по всему маркетплейсу (orders_report_materialized_view).
В схеме source1 — широкая таблица первого источника craft_market_wide.
В схеме source2 — две ненормализованные таблицы: таблица мастеров и товаров (craft_market_masters_products) и таблица заказчиков и заказов (craft_market_orders_customers).
В схеме source3 — три таблицы: мастеров (craft_market_craftsmans), заказчиков (craft_market_customers), заказов с товарами (craft_market_orders).
Схема external_source — новая. Там как раз находятся таблицы нового источника, которые нужно подключить к хранилищу.
Шаг 2. Изучение данных нового источника
Изучите данные в источнике. Там указаны две таблицы: в одной данные по мастерам, товарам и заказам (craft_products_orders), а в другой — только по заказчикам (customers). Правильно разложите данные по измерениям в хранилище. Сделайте это так же, как вы делали в первом спринте.
Данные новой схемы external_source должны оказаться в dwh в таблицах измерений и фактов. 
Шаг 3. Напишите скрипт переноса данных из источника в хранилище
Загрузка данных из нового источника — операция не на один раз: какое-то время сайт всё ещё будет существовать, пока не будет выполнен ребрендинг. А это значит, что данные из источника нужно постоянно забирать и собирать в хранилище.
Данные должны попасть в схему dwh по тому же принципу, что и из схем source1, source2, source3. Дополните скрипт загрузки данных из старых источников новым источником. 
Если нужно, изучите скрипт загрузки из старых источников.
Скрипт загрузки из старых источников
Шаг 4. Изучите потребности бизнеса в новой витрине
Изучите постановку задачи от бизнес-аналитика и исследуйте хранилище на соответствие данных. Посмотрите, какие данные понадобятся для создания DDL новой витрины. 
Бизнесу требуются следующие данные:
идентификатор записи;
идентификатор заказчика;
Ф. И. О. заказчика;
адрес заказчика;
дата рождения заказчика;
электронная почта заказчика;
сумма, которую потратил заказчик;
сумма, которую заработала платформа от покупок заказчика за месяц (10% от суммы, которую потратил заказчик);
количество заказов у заказчика за месяц;
средняя стоимость одного заказа у заказчика за месяц;
медианное время в днях от момента создания заказа до его завершения за месяц;
самая популярная категория товаров у этого заказчика за месяц;
идентификатор самого популярного мастера ручной работы у заказчика. Если заказчик сделал одинаковое количество заказов у нескольких мастеров, возьмите любого;
количество созданных заказов за месяц;
количество заказов в процессе изготовки за месяц;
количество заказов в доставке за месяц;
количество завершённых заказов за месяц;
количество незавершённых заказов за месяц;
отчётный период, год и месяц.
Шаг 5. Напишите DDL новой витрины
Напишите DDL для витрины, определив типы, названия полей и комментарии. Учитывайте, что витрина должна быть инкрементальной: понадобится дополнительная таблица с датой загрузки данных.
Витрину назовите dwh.customer_report_datamart. Возьмите за основу витрину по мастерам ручной работы. Новая витрина и витрина по мастерам будут во многом схожи.
Шаг 6. Напишите скрипт для инкрементального обновления витрины
Напишите скрипт, который будет выполнять расчёт для новой витрины. Это инкрементальная витрина, значит, и расчёт должен быть инкрементальным. За основу можно взять скрипт обновления инкрементальной витрины по мастерам.
Скрипт обновления витрины по мастерам
-- DDL витрины данных
DROP TABLE IF EXISTS dwh.craftsman_report_datamart;

CREATE TABLE IF NOT EXISTS dwh.craftsman_report_datamart (
    id BIGINT GENERATED ALWAYS AS IDENTITY NOT NULL, -- идентификатор записи
    craftsman_id BIGINT NOT NULL, -- идентификатор мастера
    craftsman_name VARCHAR NOT NULL, -- Ф.И.О. мастера
    craftsman_address VARCHAR NOT NULL, -- адрес мастера
    craftsman_birthday DATE NOT NULL, -- дата рождения мастера
    craftsman_email VARCHAR NOT NULL, -- электронная почта мастера
    craftsman_money NUMERIC(15,2) NOT NULL, -- сумма, которую заработал мастер (-10% на платформы) за месяц
    platform_money BIGINT NOT NULL, -- сумма, которую заработала платформа от продаж мастера за месяц
    count_order BIGINT NOT NULL, -- количество заказов у мастера за месяц
    avg_price_order NUMERIC(10,2) NOT NULL, -- средняя стоимость одного заказа у мастера за месяц
    avg_age_customer NUMERIC(3,1) NOT NULL, -- средний возраст покупателей
    median_time_order_completed NUMERIC(10,1), -- медианное время в днях от момента создания заказа до его завершения за месяц
    top_product_category VARCHAR NOT NULL, -- самая популярная категория товаров у этого мастера за месяц
    count_order_created BIGINT NOT NULL, -- количество созданных заказов за месяц
    count_order_in_progress BIGINT NOT NULL, -- количество заказов в процессе изготовки за месяц
    count_order_delivery BIGINT NOT NULL, -- количество заказов в доставке за месяц
    count_order_done BIGINT NOT NULL, -- количество завершённых заказов за месяц
    count_order_not_done BIGINT NOT NULL, -- количество незавершённых заказов за месяц
    report_period VARCHAR NOT NULL, -- отчётный период год и месяц
    CONSTRAINT craftsman_report_datamart_pk PRIMARY KEY (id)
);

-- DDL таблицы инкрементальных загрузок
DROP TABLE IF EXISTS dwh.load_dates_craftsman_report_datamart;

CREATE TABLE IF NOT EXISTS dwh.load_dates_craftsman_report_datamart (
    id BIGINT GENERATED ALWAYS AS IDENTITY NOT NULL,
    load_dttm DATE NOT NULL,
    CONSTRAINT load_dates_craftsman_report_datamart_pk PRIMARY KEY (id)
);

WITH
dwh_delta AS ( -- определяем, какие данные были изменены в витрине или добавлены в DWH. Формируем дельту изменений
    SELECT     
            dc.craftsman_id AS craftsman_id,
            dc.craftsman_name AS craftsman_name,
            dc.craftsman_address AS craftsman_address,
            dc.craftsman_birthday AS craftsman_birthday,
            dc.craftsman_email AS craftsman_email,
            fo.order_id AS order_id,
            dp.product_id AS product_id,
            dp.product_price AS product_price,
            dp.product_type AS product_type,
            DATE_PART('year', AGE(dcs.customer_birthday)) AS customer_age,
            fo.order_completion_date - fo.order_created_date AS diff_order_date, 
            fo.order_status AS order_status,
            TO_CHAR(fo.order_created_date, 'yyyy-mm') AS report_period,
            crd.craftsman_id AS exist_craftsman_id,
            dc.load_dttm AS craftsman_load_dttm,
            dcs.load_dttm AS customers_load_dttm,
            dp.load_dttm AS products_load_dttm
            FROM dwh.f_order fo 
                INNER JOIN dwh.d_craftsman dc ON fo.craftsman_id = dc.craftsman_id 
                INNER JOIN dwh.d_customer dcs ON fo.customer_id = dcs.customer_id 
                INNER JOIN dwh.d_product dp ON fo.product_id = dp.product_id 
                LEFT JOIN dwh.craftsman_report_datamart crd ON dc.craftsman_id = crd.craftsman_id
                    WHERE (fo.load_dttm > (SELECT COALESCE(MAX(load_dttm),'1900-01-01') FROM dwh.load_dates_craftsman_report_datamart)) OR
                            (dc.load_dttm > (SELECT COALESCE(MAX(load_dttm),'1900-01-01') FROM dwh.load_dates_craftsman_report_datamart)) OR
                            (dcs.load_dttm > (SELECT COALESCE(MAX(load_dttm),'1900-01-01') FROM dwh.load_dates_craftsman_report_datamart)) OR
                            (dp.load_dttm > (SELECT COALESCE(MAX(load_dttm),'1900-01-01') FROM dwh.load_dates_craftsman_report_datamart))
),
dwh_update_delta AS ( -- делаем выборку мастеров ручной работы, по которым были изменения в DWH. По этим мастерам данные в витрине нужно будет обновить
    SELECT     
            dd.exist_craftsman_id AS craftsman_id
            FROM dwh_delta dd 
                WHERE dd.exist_craftsman_id IS NOT NULL        
),
dwh_delta_insert_result AS ( -- делаем расчёт витрины по новым данным. Этой информации по мастерам в рамках расчётного периода раньше не было, это новые данные. Их можно просто вставить (insert) в витрину без обновления
    SELECT  
            T4.craftsman_id AS craftsman_id,
            T4.craftsman_name AS craftsman_name,
            T4.craftsman_address AS craftsman_address,
            T4.craftsman_birthday AS craftsman_birthday,
            T4.craftsman_email AS craftsman_email,
            T4.craftsman_money AS craftsman_money,
            T4.platform_money AS platform_money,
            T4.count_order AS count_order,
            T4.avg_price_order AS avg_price_order,
            T4.avg_age_customer AS avg_age_customer,
            T4.product_type AS top_product_category,
            T4.median_time_order_completed AS median_time_order_completed,
            T4.count_order_created AS count_order_created,
            T4.count_order_in_progress AS count_order_in_progress,
            T4.count_order_delivery AS count_order_delivery,
            T4.count_order_done AS count_order_done,
            T4.count_order_not_done AS count_order_not_done,
            T4.report_period AS report_period 
            FROM (
                SELECT     -- в этой выборке объединяем две внутренние выборки по расчёту столбцов витрины и применяем оконную функцию для определения самой популярной категории товаров
                        *,
                        RANK() OVER(PARTITION BY T2.craftsman_id ORDER BY count_product DESC) AS rank_count_product 
                        FROM ( 
                            SELECT -- в этой выборке делаем расчёт по большинству столбцов, так как все они требуют одной и той же группировки, кроме столбца с самой популярной категорией товаров у мастера. Для этого столбца сделаем отдельную выборку с другой группировкой и выполним JOIN
                                T1.craftsman_id AS craftsman_id,
                                T1.craftsman_name AS craftsman_name,
                                T1.craftsman_address AS craftsman_address,
                                T1.craftsman_birthday AS craftsman_birthday,
                                T1.craftsman_email AS craftsman_email,
                                SUM(T1.product_price) - (SUM(T1.product_price) * 0.1) AS craftsman_money,
                                SUM(T1.product_price) * 0.1 AS platform_money,
                                COUNT(order_id) AS count_order,
                                AVG(T1.product_price) AS avg_price_order,
                                AVG(T1.customer_age) AS avg_age_customer,
                                PERCENTILE_CONT(0.5) WITHIN GROUP(ORDER BY diff_order_date) AS median_time_order_completed,
                                SUM(CASE WHEN T1.order_status = 'created' THEN 1 ELSE 0 END) AS count_order_created,
                                SUM(CASE WHEN T1.order_status = 'in progress' THEN 1 ELSE 0 END) AS count_order_in_progress, 
                                SUM(CASE WHEN T1.order_status = 'delivery' THEN 1 ELSE 0 END) AS count_order_delivery, 
                                SUM(CASE WHEN T1.order_status = 'done' THEN 1 ELSE 0 END) AS count_order_done, 
                                SUM(CASE WHEN T1.order_status != 'done' THEN 1 ELSE 0 END) AS count_order_not_done,
                                T1.report_period AS report_period
                                FROM dwh_delta AS T1
                                    WHERE T1.exist_craftsman_id IS NULL
                                        GROUP BY T1.craftsman_id, T1.craftsman_name, T1.craftsman_address, T1.craftsman_birthday, T1.craftsman_email, T1.report_period
                            ) AS T2 
                                INNER JOIN (
                                    SELECT     -- Эта выборка поможет определить самый популярный товар у мастера ручной работы. Эта выборка не делается в предыдущем запросе, так как нужна другая группировка. Для данных этой выборки можно применить оконную функцию, которая и покажет самую популярную категорию товаров у мастера
                                            dd.craftsman_id AS craftsman_id_for_product_type, 
                                            dd.product_type, 
                                            COUNT(dd.product_id) AS count_product
                                            FROM dwh_delta AS dd
                                                GROUP BY dd.craftsman_id, dd.product_type
                                                    ORDER BY count_product DESC) AS T3 ON T2.craftsman_id = T3.craftsman_id_for_product_type
                ) AS T4 WHERE T4.rank_count_product = 1 ORDER BY report_period -- условие помогает оставить в выборке первую по популярности категорию товаров
),
dwh_delta_update_result AS ( -- делаем перерасчёт для существующих записей витринs, так как данные обновились за отчётные периоды. Логика похожа на insert, но нужно достать конкретные данные из DWH
    SELECT 
            T4.craftsman_id AS craftsman_id,
            T4.craftsman_name AS craftsman_name,
            T4.craftsman_address AS craftsman_address,
            T4.craftsman_birthday AS craftsman_birthday,
            T4.craftsman_email AS craftsman_email,
            T4.craftsman_money AS craftsman_money,
            T4.platform_money AS platform_money,
            T4.count_order AS count_order,
            T4.avg_price_order AS avg_price_order,
            T4.avg_age_customer AS avg_age_customer,
            T4.product_type AS top_product_category,
            T4.median_time_order_completed AS median_time_order_completed,
            T4.count_order_created AS count_order_created,
            T4.count_order_in_progress AS count_order_in_progress,
            T4.count_order_delivery AS count_order_delivery, 
            T4.count_order_done AS count_order_done, 
            T4.count_order_not_done AS count_order_not_done,
            T4.report_period AS report_period 
            FROM (
                SELECT     -- в этой выборке объединяем две внутренние выборки по расчёту столбцов витрины и применяем оконную функцию для определения самой популярной категории товаров
                        *,
                        RANK() OVER(PARTITION BY T2.craftsman_id ORDER BY count_product DESC) AS rank_count_product 
                        FROM (
                            SELECT -- в этой выборке делаем расчёт по большинству столбцов, так как все они требуют одной и той же группировки, кроме столбца с самой популярной категорией товаров у мастера. Для этого столбца сделаем отдельную выборку с другой группировкой и выполним JOIN
                                T1.craftsman_id AS craftsman_id,
                                T1.craftsman_name AS craftsman_name,
                                T1.craftsman_address AS craftsman_address,
                                T1.craftsman_birthday AS craftsman_birthday,
                                T1.craftsman_email AS craftsman_email,
                                SUM(T1.product_price) - (SUM(T1.product_price) * 0.1) AS craftsman_money,
                                SUM(T1.product_price) * 0.1 AS platform_money,
                                COUNT(order_id) AS count_order,
                                AVG(T1.product_price) AS avg_price_order,
                                AVG(T1.customer_age) AS avg_age_customer,
                                PERCENTILE_CONT(0.5) WITHIN GROUP(ORDER BY diff_order_date) AS median_time_order_completed,
                                SUM(CASE WHEN T1.order_status = 'created' THEN 1 ELSE 0 END) AS count_order_created, 
                                SUM(CASE WHEN T1.order_status = 'in progress' THEN 1 ELSE 0 END) AS count_order_in_progress, 
                                SUM(CASE WHEN T1.order_status = 'delivery' THEN 1 ELSE 0 END) AS count_order_delivery, 
                                SUM(CASE WHEN T1.order_status = 'done' THEN 1 ELSE 0 END) AS count_order_done, 
                                SUM(CASE WHEN T1.order_status != 'done' THEN 1 ELSE 0 END) AS count_order_not_done,
                                T1.report_period AS report_period
                                FROM (
                                    SELECT     -- в этой выборке достаём из DWH обновлённые или новые данные по мастерам, которые уже есть в витрине
                                            dc.craftsman_id AS craftsman_id,
                                            dc.craftsman_name AS craftsman_name,
                                            dc.craftsman_address AS craftsman_address,
                                            dc.craftsman_birthday AS craftsman_birthday,
                                            dc.craftsman_email AS craftsman_email,
                                            fo.order_id AS order_id,
                                            dp.product_id AS product_id,
                                            dp.product_price AS product_price,
                                            dp.product_type AS product_type,
                                            DATE_PART('year', AGE(dcs.customer_birthday)) AS customer_age,
                                            fo.order_completion_date - fo.order_created_date AS diff_order_date,
                                            fo.order_status AS order_status, 
                                            TO_CHAR(fo.order_created_date, 'yyyy-mm') AS report_period
                                            FROM dwh.f_order fo 
                                                INNER JOIN dwh.d_craftsman dc ON fo.craftsman_id = dc.craftsman_id 
                                                INNER JOIN dwh.d_customer dcs ON fo.customer_id = dcs.customer_id 
                                                INNER JOIN dwh.d_product dp ON fo.product_id = dp.product_id
                                                INNER JOIN dwh_update_delta ud ON fo.craftsman_id = ud.craftsman_id
                                ) AS T1
                                    GROUP BY T1.craftsman_id, T1.craftsman_name, T1.craftsman_address, T1.craftsman_birthday, T1.craftsman_email, T1.report_period
                            ) AS T2 
                                INNER JOIN (
                                    SELECT     -- Эта выборка поможет определить самый популярный товар у мастера. Эта выборка не делается в предыдущем запросе, так как нужна другая группировка. Для данных этой выборки можно применить оконную функцию, которая и покажет самую популярную категорию товаров у мастера
                                            dd.craftsman_id AS craftsman_id_for_product_type, 
                                            dd.product_type, 
                                            COUNT(dd.product_id) AS count_product
                                            FROM dwh_delta AS dd
                                                GROUP BY dd.craftsman_id, dd.product_type
                                                    ORDER BY count_product DESC) AS T3 ON T2.craftsman_id = T3.craftsman_id_for_product_type
                ) AS T4 WHERE T4.rank_count_product = 1 ORDER BY report_period
),
insert_delta AS ( -- выполняем insert новых расчитанных данных для витрины 
    INSERT INTO dwh.craftsman_report_datamart (
        craftsman_id,
        craftsman_name,
        craftsman_address,
        craftsman_birthday, 
        craftsman_email, 
        craftsman_money, 
        platform_money, 
        count_order, 
        avg_price_order, 
        avg_age_customer,
        median_time_order_completed,
        top_product_category, 
        count_order_created, 
        count_order_in_progress, 
        count_order_delivery, 
        count_order_done, 
        count_order_not_done, 
        report_period
    ) SELECT 
            craftsman_id,
            craftsman_name,
            craftsman_address,
            craftsman_birthday,
            craftsman_email,
            craftsman_money,
            platform_money,
            count_order,
            avg_price_order,
            avg_age_customer,
            median_time_order_completed,
            top_product_category,
            count_order_created, 
            count_order_in_progress,
            count_order_delivery, 
            count_order_done, 
            count_order_not_done,
            report_period 
            FROM dwh_delta_insert_result
),
update_delta AS ( -- выполняем обновление показателей в отчёте по уже существующим мастерам
    UPDATE dwh.craftsman_report_datamart SET
        craftsman_name = updates.craftsman_name, 
        craftsman_address = updates.craftsman_address, 
        craftsman_birthday = updates.craftsman_birthday, 
        craftsman_email = updates.craftsman_email, 
        craftsman_money = updates.craftsman_money, 
        platform_money = updates.platform_money, 
        count_order = updates.count_order, 
        avg_price_order = updates.avg_price_order, 
        avg_age_customer = updates.avg_age_customer, 
        median_time_order_completed = updates.median_time_order_completed, 
        top_product_category = updates.top_product_category, 
        count_order_created = updates.count_order_created, 
        count_order_in_progress = updates.count_order_in_progress, 
        count_order_delivery = updates.count_order_delivery, 
        count_order_done = updates.count_order_done,
        count_order_not_done = updates.count_order_not_done, 
        report_period = updates.report_period
    FROM (
        SELECT 
            craftsman_id,
            craftsman_name,
            craftsman_address,
            craftsman_birthday,
            craftsman_email,
            craftsman_money,
            platform_money,
            count_order,
            avg_price_order,
            avg_age_customer,
            median_time_order_completed,
            top_product_category,
            count_order_created,
            count_order_in_progress,
            count_order_delivery,
            count_order_done,
            count_order_not_done,
            report_period 
            FROM dwh_delta_update_result) AS updates
    WHERE dwh.craftsman_report_datamart.craftsman_id = updates.craftsman_id
),
insert_load_date AS ( -- делаем запись в таблицу загрузок о том, когда была совершена загрузка, чтобы в следующий раз взять данные, которые будут добавлены или изменены после этой даты
    INSERT INTO dwh.load_dates_craftsman_report_datamart (
        load_dttm
    )
    SELECT GREATEST(COALESCE(MAX(craftsman_load_dttm), NOW()), 
                    COALESCE(MAX(customers_load_dttm), NOW()), 
                    COALESCE(MAX(products_load_dttm), NOW())) 
        FROM dwh_delta
)
SELECT 'increment datamart'; -- инициализируем запрос CTE 
Чтобы получить идентификатор самого популярного мастера у заказчика, можно попробовать написать ещё один INNER JOIN по аналогии с определением самой популярной категории товаров. Самый популярный мастер определяется по количеству заказов от заказчика. Если заказчик сделал одинаковое количество заказов у нескольких мастеров, возьмите идентификатор любого. Для этого воспользуйтесь командами DISTINCT ON (COLUMN) или FIRST_VALUE. Или же можно вместо оконной функции RANK() воспользоваться оконной функцией ROW_NUMBER().
Как будут проверять мой проект
На что обращают внимание при проверке проектов:
логично ли написаны SQL-запросы;
выбраны ли эффективные типы данных в DDL;
нет ли аномалий, дублей или пропусков в данных.
Всё необходимое для того, чтобы выполнить проект, есть в темах, которые вы прошли. 
Успехов!

Сдать работу
